Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/svd/PIC32CM1216LS00064.svd
            <register>
               <name>DFLLCTRL</name>
               <description>DFLL48M Control</description>
               <addressOffset>0x30</addressOffset>
               <size>16</size>
               <resetValue>0x0080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>DFLL Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Operating Mode Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STABLE</name>
                     <description>Stable DFLL Frequency</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LLAW</name>
                     <description>Lose Lock After Wake</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBCRM</name>
                     <description>USB Clock Recovery Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCDIS</name>
                     <description>Chill Cycle Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QLDIS</name>
                     <description>Quick Lock Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BPLCKC</name>
                     <description>Bypass Coarse Lock</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAITLOCK</name>
                     <description>Wait Lock</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLVAL</name>
               <description>DFLL48M Value</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FINE</name>
                     <description>Fine Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>COARSE</name>
                     <description>Coarse Value</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DIFF</name>
                     <description>Multiplication Ratio Difference</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLMUL</name>
               <description>DFLL48M Multiplier</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MUL</name>
                     <description>DFLL Multiply Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FSTEP</name>
                     <description>Fine Maximum Step</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSTEP</name>
                     <description>Coarse Maximum Step</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLSYNC</name>
               <description>DFLL48M Synchronization</description>
               <addressOffset>0x3C</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>READREQ</name>
                     <description>Read Request</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLCTRLA</name>
               <description>DPLL Control A</description>
               <addressOffset>0x40</addressOffset>
               <size>8</size>
               <resetValue>0x80</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>DPLL Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Clock Activation</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLRATIO</name>
               <description>DPLL Ratio Control</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LDR</name>
                     <description>Loop Divider Ratio</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>LDRFRAC</name>
                     <description>Loop Divider Ratio Fractional Part</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLCTRLB</name>
               <description>DPLL Control B</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FILTER</name>
                     <description>Proportional Integral Filter Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FILTERSelect</name>
                        <enumeratedValue>
                           <name>DEFAULT</name>
                           <description>Default Filter Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LBFILT</name>
                           <description>Low Bandwidth Filter</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HBFILT</name>
                           <description>High Bandwidth Filter</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HDFILT</name>
                           <description>High Damping Filter</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPEN</name>
                     <description>Low-Power Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUF</name>
                     <description>Wake Up Fast</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFCLK</name>
                     <description>Reference Clock Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>REFCLKSelect</name>
                        <enumeratedValue>
                           <name>XOSC32K</name>
                           <description>XOSC32K Clock Reference</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC</name>
                           <description>XOSC Clock Reference</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK</name>
                           <description>GCLK Clock Reference</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LTIME</name>
                     <description>Lock Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LTIMESelect</name>
                        <enumeratedValue>
                           <name>Default</name>
                           <description>No time-out. Automatic lock</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8MS</name>
                           <description>Time-out if no lock within 8 ms</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>9MS</name>
                           <description>Time-out if no lock within 9 ms</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10MS</name>
                           <description>Time-out if no lock within 10 ms</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11MS</name>
                           <description>Time-out if no lock within 11 ms</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LBYPASS</name>
                     <description>Lock Bypass</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIV</name>
                     <description>Clock Divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLPRESC</name>
               <description>DPLL Prescaler</description>
               <addressOffset>0x4C</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PRESC</name>
                     <description>Output Clock Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PRESCSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>DPLL output is divided by 1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>DPLL output is divided by 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>DPLL output is divided by 4</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLSYNCBUSY</name>
               <description>DPLL Synchronization Busy</description>
               <addressOffset>0x50</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>DPLL Enable Synchronization Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLRATIO</name>
                     <description>DPLL Loop Divider Ratio Synchronization Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLPRESC</name>
                     <description>DPLL Prescaler Synchronization Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLSTATUS</name>
               <description>DPLL Status</description>
               <addressOffset>0x54</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>DPLL Lock</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKRDY</name>
                     <description>DPLL Clock Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
